getantidote/use-omz

$ZDOTFILES_DIR/plugins/starship

ohmyzsh/ohmyzsh path:plugins/git
$ZDOTFILES_DIR/plugins/git-utils
$ZDOTFILES_DIR/plugins/git-worktree

ohmyzsh/ohmyzsh path:plugins/brew
$ZDOTFILES_DIR/plugins/brew.zsh

$ZDOTFILES_DIR/plugins/carapace.zsh

$ZDOTFILES_DIR/plugins/github-cli
ohmyzsh/ohmyzsh path:plugins/gh conditional:"exists gh"

$ZDOTFILES_DIR/plugins/bat.zsh

$ZDOTFILES_DIR/plugins/bun.zsh
ohmyzsh/ohmyzsh path:plugins/bun conditional:"exists bun"

$ZDOTFILES_DIR/plugins/cloudflare.zsh

$ZDOTFILES_DIR/plugins/code.zsh

$ZDOTFILES_DIR/plugins/cursor.zsh

$ZDOTFILES_DIR/plugins/antigravity.zsh

$ZDOTFILES_DIR/plugins/deno.zsh
ohmyzsh/ohmyzsh path:plugins/deno conditional:"exists deno"

$ZDOTFILES_DIR/plugins/direnv

$ZDOTFILES_DIR/plugins/docker.zsh
ohmyzsh/ohmyzsh path:plugins/docker conditional:"exists docker"

$ZDOTFILES_DIR/plugins/fabric.zsh

$ZDOTFILES_DIR/plugins/fonts.zsh

$ZDOTFILES_DIR/plugins/golang
ohmyzsh/ohmyzsh path:plugins/golang conditional:"exists go"

$ZDOTFILES_DIR/plugins/jq.zsh

$ZDOTFILES_DIR/plugins/node-fnm.zsh

$ZDOTFILES_DIR/plugins/ollama.zsh

$ZDOTFILES_DIR/plugins/python
ohmyzsh/ohmyzsh path:plugins/uv conditional:"exists uv"

$ZDOTFILES_DIR/plugins/rust.zsh
ohmyzsh/ohmyzsh path:plugins/rust conditional:"exists cargo"

$ZDOTFILES_DIR/plugins/ruby-rbenv.zsh
ohmyzsh/ohmyzsh path:plugins/rbenv conditional:"exists rbenv"
ohmyzsh/ohmyzsh path:plugins/ruby conditional:"exists ruby"

$ZDOTFILES_DIR/plugins/zed.zsh

$ZDOTFILES_DIR/plugins/zig.zsh

$ZDOTFILES_DIR/plugins/zoxide.zsh

$ZDOTFILES_DIR/plugins/gemini-cli.zsh

$ZDOTFILES_DIR/plugins/codex

$ZDOTFILES_DIR/plugins/ghostty

$ZDOTFILES_DIR/plugins/wezterm

$ZDOTFILES_DIR/plugins/claude-code.zsh

$ZDOTFILES_DIR/plugins/lsd.zsh

$ZDOTFILES_DIR/plugins/yazi

$ZDOTFILES_DIR/plugins/opencode.zsh

$ZDOTFILES_DIR/plugins/flutter.zsh
ohmyzsh/ohmyzsh path:plugins/flutter conditional:"exists flutter"

$ZDOTFILES_DIR/plugins/fzf.zsh
Aloxaf/fzf-tab conditional:"exists fzf"

$ZDOTFILES_DIR/plugins/zellij

$ZDOTFILES_DIR/plugins/atuin.zsh

# mise must be loaded last to override other plugins behaviors
$ZDOTFILES_DIR/plugins/mise.zsh

# UX plugins
zsh-users/zsh-autosuggestions
z-shell/F-Sy-H
MichaelAquilina/zsh-you-should-use
