getantidote/use-omz

$ZDOTFILES_DIR/plugins/starship

ohmyzsh/ohmyzsh path:plugins/git
$ZDOTFILES_DIR/plugins/git-utils kind:defer
$ZDOTFILES_DIR/plugins/git-worktree kind:defer

ohmyzsh/ohmyzsh path:plugins/brew
$ZDOTFILES_DIR/plugins/brew.zsh

$ZDOTFILES_DIR/plugins/carapace.zsh kind:defer

$ZDOTFILES_DIR/plugins/github-cli
ohmyzsh/ohmyzsh path:plugins/gh conditional:"exists gh"

$ZDOTFILES_DIR/plugins/bat.zsh kind:defer

$ZDOTFILES_DIR/plugins/bun.zsh
ohmyzsh/ohmyzsh path:plugins/bun conditional:"exists bun"

$ZDOTFILES_DIR/plugins/cloudflare.zsh

$ZDOTFILES_DIR/plugins/code.zsh kind:defer

$ZDOTFILES_DIR/plugins/cursor.zsh kind:defer

$ZDOTFILES_DIR/plugins/antigravity.zsh kind:defer

$ZDOTFILES_DIR/plugins/deno.zsh
ohmyzsh/ohmyzsh path:plugins/deno kind:defer conditional:"exists deno"

$ZDOTFILES_DIR/plugins/direnv

$ZDOTFILES_DIR/plugins/docker.zsh kind:defer
ohmyzsh/ohmyzsh path:plugins/docker kind:defer conditional:"exists docker"

$ZDOTFILES_DIR/plugins/fabric.zsh kind:defer

$ZDOTFILES_DIR/plugins/fonts.zsh kind:defer

$ZDOTFILES_DIR/plugins/golang
ohmyzsh/ohmyzsh path:plugins/golang kind:defer conditional:"exists go"

$ZDOTFILES_DIR/plugins/jq.zsh kind:defer

$ZDOTFILES_DIR/plugins/node-fnm.zsh

$ZDOTFILES_DIR/plugins/ollama.zsh kind:defer

$ZDOTFILES_DIR/plugins/python
ohmyzsh/ohmyzsh path:plugins/uv conditional:"exists uv"

$ZDOTFILES_DIR/plugins/rust.zsh
ohmyzsh/ohmyzsh path:plugins/rust kind:defer conditional:"exists cargo"

$ZDOTFILES_DIR/plugins/ruby-rbenv.zsh
ohmyzsh/ohmyzsh path:plugins/rbenv conditional:"exists rbenv"
ohmyzsh/ohmyzsh path:plugins/ruby conditional:"exists ruby"

$ZDOTFILES_DIR/plugins/zed.zsh kind:defer

$ZDOTFILES_DIR/plugins/zig.zsh kind:defer

$ZDOTFILES_DIR/plugins/zoxide.zsh

$ZDOTFILES_DIR/plugins/gemini-cli.zsh kind:defer

$ZDOTFILES_DIR/plugins/codex kind:defer

$ZDOTFILES_DIR/plugins/ghostty kind:defer

$ZDOTFILES_DIR/plugins/wezterm kind:defer

$ZDOTFILES_DIR/plugins/claude-code.zsh kind:defer

$ZDOTFILES_DIR/plugins/lsd.zsh kind:defer

$ZDOTFILES_DIR/plugins/yazi kind:defer

$ZDOTFILES_DIR/plugins/opencode.zsh kind:defer

$ZDOTFILES_DIR/plugins/flutter.zsh kind:defer
ohmyzsh/ohmyzsh path:plugins/flutter kind:defer conditional:"exists flutter"

$ZDOTFILES_DIR/plugins/fzf.zsh kind:defer
Aloxaf/fzf-tab kind:defer conditional:"exists fzf"

$ZDOTFILES_DIR/plugins/zellij.zsh kind:defer

$ZDOTFILES_DIR/plugins/atuin.zsh

# mise must be loaded last to override other plugins behaviors
$ZDOTFILES_DIR/plugins/mise.zsh

zsh-users/zsh-autosuggestions kind:defer
z-shell/F-Sy-H kind:defer
MichaelAquilina/zsh-you-should-use kind:defer
